# DeformationType Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarBarType..::..DeformationType Property
RebarBarType Class See Also
---
Defines bar deformation type.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public RebarDeformationType DeformationType { get; set; }
```

Visual Basic
---
```text
Public Property DeformationType As RebarDeformationType
	Get
	Set
```

Visual C++
---
```text
public:
property RebarDeformationType DeformationType {
	RebarDeformationType get ();
	void set (RebarDeformationType value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
RebarBarType Class
Autodesk.Revit.DB.Structure Namespace